Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныСпециализаций</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУстановкиЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_ИсходнаяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_СоглашенияСтрахования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСертификата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специализации</Name>
					<Comment>Для целей расчета з/п</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_Филиалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_Прейскуранты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Прейскурант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_НоменклатураНаборов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Набор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВНаборе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаОбщая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВложенныйНабор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Набор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга, не хранится на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаЦен/Forms/омг_ФормаПодбораНоменклатурыНабора/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьВыборкуЦен(Набор, Филиалы, ОсновнойПрейскурант, Комплектующая = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Набор", Набор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	               |	НоменклатураКомплектующиеНоменклатуры.НомерСтроки КАК НомерСтроки,
	               |	НоменклатураКомплектующиеНоменклатуры.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТ_НоменклатураНабора
	               |ИЗ
	               |	Справочник.Номенклатура.КомплектующиеНоменклатуры КАК НоменклатураКомплектующиеНоменклатуры
	               |ГДЕ
	               |	НоменклатураКомплектующиеНоменклатуры.Ссылка = &Набор
	               |	И ВЫБОР
	               |			КОГДА &Комплектующая = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая,
	               |	НоменклатураКомплектующиеНоменклатуры.НомерСтроки,
	               |	НоменклатураКомплектующиеНоменклатуры.Количество
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&Комплектующая,
	               |	1,
	               |	1
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ &Комплектующая = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НоменклатураНабора.Комплектующая КАК Номенклатура,
	               |	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) КАК Цена,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.омг_Набор, НЕОПРЕДЕЛЕНО) КАК омг_Набор,
	               |	МАКСИМУМ(ВТ_НоменклатураНабора.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ВсеЦеныКопмлектующих
	               |ИЗ
	               |	ВТ_НоменклатураНабора КАК ВТ_НоменклатураНабора
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				,
	               |				(Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ВТ_НоменклатураНабора.Комплектующая КАК Комплектующая
	               |						ИЗ
	               |							ВТ_НоменклатураНабора КАК ВТ_НоменклатураНабора)
	               |					ИЛИ Номенклатура = &Комплектующая)
	               |					И омг_Филиал В (&Филиалы)
	               |					И Прейскурант = &ОсновнойПрейскурант
	               |					И (омг_Набор = &Набор
	               |						ИЛИ омг_Набор = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ВТ_НоменклатураНабора.Комплектующая = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_НоменклатураНабора.Комплектующая,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.омг_Набор, НЕОПРЕДЕЛЕНО)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.ЦенаВНаборе КАК ЦенаВНаборе,
	               |	ВложенныйЗапрос.ЦенаОбщая КАК ЦенаОбщая,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.ЦенаОбщая = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ВложенныйЗапрос.ЦенаВНаборе / ВложенныйЗапрос.ЦенаОбщая
	               |	КОНЕЦ КАК Коэффициент,
	               |	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	               |	ВложенныйЗапрос.Количество КАК Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_НоменклатураНабора.Комплектующая КАК Номенклатура,
	               |		МАКСИМУМ(ЕСТЬNULL(ЦеныВНаборе.Цена, 0)) КАК ЦенаВНаборе,
	               |		МАКСИМУМ(ЕСТЬNULL(ЦеныОбщие.Цена, 0)) КАК ЦенаОбщая,
	               |		МАКСИМУМ(ВТ_НоменклатураНабора.НомерСтроки) КАК НомерСтроки,
	               |		МАКСИМУМ(ВТ_НоменклатураНабора.Количество) КАК Количество
	               |	ИЗ
	               |		ВТ_НоменклатураНабора КАК ВТ_НоменклатураНабора
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеЦеныКопмлектующих КАК ЦеныВНаборе
	               |			ПО ВТ_НоменклатураНабора.Комплектующая = ЦеныВНаборе.Номенклатура
	               |				И (ЦеныВНаборе.омг_Набор = &Набор)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеЦеныКопмлектующих КАК ЦеныОбщие
	               |			ПО ВТ_НоменклатураНабора.Комплектующая = ЦеныОбщие.Номенклатура
	               |				И (ЦеныОбщие.омг_Набор = ЗНАЧЕНИЕ(Справочник.НОменклатура.ПустаяСсылка))
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_НоменклатураНабора.Комплектующая) КАК ВложенныйЗапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("Набор", Набор);
	Запрос.УстановитьПараметр("Комплектующая", Комплектующая);
	Запрос.УстановитьПараметр("Филиалы", Филиалы);
	Запрос.УстановитьПараметр("ОсновнойПрейскурант", ОсновнойПрейскурант);
	Выборка = Запрос.Выполнить().Выбрать();
	
    Возврат Выборка;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере(Комплектующая = Неопределено)
	
	Выборка = ПолучитьВыборкуЦен(Набор, Филиалы, ОсновнойПрейскурант, Комплектующая);
	
	НоменклатураНабора.Очистить();
	
	Пока Выборка.Следующий() Цикл
		СтрокаНабора = НоменклатураНабора.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка);
		Если Выборка.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда
			ВыборкаНаборВнаборе = ЗапросНаборВнаборе(Выборка.Номенклатура,Филиалы,ОсновнойПрейскурант); 
			НоменклатураНабораВложенныйНабор.Очистить(); 
			стрОТбора = Новый Структура;
			стрОТбора.Вставить("ВложенныйНабор",Выборка.Номенклатура);
			
			СтрокиУдаления = НоменклатураНабораВложенныйНаборВнутренний.НайтиСтроки(стрОТбора);  
			Для каждого строкаУдаления из СтрокиУдаления Цикл
				НоменклатураНабораВложенныйНаборВнутренний.Удалить(строкаУдаления);		
			КонецЦикла;		
			Пока ВыборкаНаборВнаборе.Следующий() Цикл
				СтрокаНабора = НоменклатураНабораВложенныйНаборВнутренний.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаНаборВнаборе);
				СтрокаНабора.ВложенныйНабор = Выборка.Номенклатура; 
				СтрокаНабора = НоменклатураНабораВложенныйНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаНаборВнаборе);
				СтрокаНабора.ВложенныйНабор = Выборка.Номенклатура;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
	ПересчитатьИтогиЦен(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Филиалы = Параметры.Филиалы;
	Набор = Параметры.Набор;
	ТекущийПериод = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Набор, "омг_ДатаНачалДействияНабора, омг_ДатаОкончанияДействияНабора");
	ПериодДействияНабора.ДатаНачала = ТекущийПериод.омг_ДатаНачалДействияНабора;
	ПериодДействияНабора.ДатаОкончания = ТекущийПериод.омг_ДатаОкончанияДействияНабора;
	ОсновнойПрейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант");
	
	Для Каждого ЭлементМассива Из Параметры.МассивПозиций Цикл
		Если ЗначениеЗаполнено(ЭлементМассива.ВложенныйНабор) Тогда
			СтрокаТаблицы = НоменклатураНабораВложенныйНаборВнутренний.Добавить();	
		иначе	
			СтрокаТаблицы = НоменклатураНабора.Добавить(); 
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЭлементМассива);
	КонецЦикла;
	
	ПересчитатьИтогиЦен(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	МассивПозиций = Новый Массив;
	Для Каждого СтрокаТаблицы Из НоменклатураНабора Цикл
		СтруктураСтроки = Новый Структура("Номенклатура, ЦенаВНаборе, ЦенаОбщая, Коэффициент, Набор,ВложенныйНабор");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТаблицы);     
		СтруктураСтроки.Набор = Набор; 
		МассивПозиций.Добавить(СтруктураСтроки);
	КонецЦикла;  
	
	Для Каждого СтрокаТаблицы Из НоменклатураНабораВложенныйНаборВнутренний Цикл
		СтруктураСтроки = Новый Структура("Номенклатура, ЦенаВНаборе, ЦенаОбщая, Коэффициент, Набор,ВложенныйНабор");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТаблицы);     
		СтруктураСтроки.Набор = Набор; 
		МассивПозиций.Добавить(СтруктураСтроки);
	КонецЦикла;

	
	Закрыть(МассивПозиций);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоОбщим(Команда)
	
	Для Каждого СтрокаТаблицы Из НоменклатураНабора Цикл
		СтрокаТаблицы.ЦенаВНаборе = СтрокаТаблицы.ЦенаОбщая;
	КонецЦикла;
	
	ПересчитатьИтогиЦен(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьЦеныОднимКоэффициентом(Команда)
	
	Коэффициент = Ждать ВвестиЗначениеАсинх(0, "Коэффициент", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2)); 
	
	Для Каждого СтрокаТаблицы Из НоменклатураНабора Цикл
		СтрокаТаблицы.ЦенаВНаборе = СтрокаТаблицы.ЦенаОбщая * Коэффициент;
		СтрокаТаблицы.Коэффициент = Коэффициент;
	КонецЦикла;
	
	ПересчитатьИтогиЦен(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьИтогиЦен(ЭтаФорма)
	
	ЭтаФорма.Элементы.НоменклатураНабораЦенаОбщая.ТекстПодвала = ЭтаФорма.НоменклатураНабора.Итог("ЦенаОбщая");
	ЭтаФорма.Элементы.НоменклатураНабораЦена.ТекстПодвала = ЭтаФорма.НоменклатураНабора.Итог("ЦенаВНаборе");
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНабораПриИзменении(Элемент)
	
	ПересчитатьИтогиЦен(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ЗапросНаборВнаборе(НаборНабор,Филиалы,ОсновнойПрейскурантНабор)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Набор", НаборНабор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая КАК Комплектующая
	               |ПОМЕСТИТЬ ВТ_НоменклатураНабора
	               |ИЗ
	               |	Справочник.Номенклатура.КомплектующиеНоменклатуры КАК НоменклатураКомплектующиеНоменклатуры
	               |ГДЕ
	               |	НоменклатураКомплектующиеНоменклатуры.Ссылка = &Набор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НоменклатураНабора.Комплектующая КАК Номенклатура,
	               |	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) КАК Цена,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.омг_Набор, НЕОПРЕДЕЛЕНО) КАК омг_Набор
	               |ПОМЕСТИТЬ ВТ_ВсеЦеныКопмлектующих
	               |ИЗ
	               |	ВТ_НоменклатураНабора КАК ВТ_НоменклатураНабора
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				,
	               |				Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ВТ_НоменклатураНабора.Комплектующая КАК Комплектующая
	               |						ИЗ
	               |							ВТ_НоменклатураНабора КАК ВТ_НоменклатураНабора)
	               |					И омг_Филиал В (&Филиалы)
	               |					И Прейскурант = &ОсновнойПрейскурант
	               |					И (омг_Набор = &Набор
	               |						ИЛИ омг_Набор = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ВТ_НоменклатураНабора.Комплектующая = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_НоменклатураНабора.Комплектующая,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.омг_Набор, НЕОПРЕДЕЛЕНО)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	МАКСИМУМ(ВложенныйЗапрос.ЦенаВНаборе) КАК ЦенаВНаборе,
	               |	МАКСИМУМ(ВложенныйЗапрос.ЦенаОбщая) КАК ЦенаОбщая
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_НоменклатураНабора.Комплектующая КАК Номенклатура,
	               |		МАКСИМУМ(ЕСТЬNULL(ЦеныВНаборе.Цена, 0)) КАК ЦенаВНаборе,
	               |		МАКСИМУМ(ЕСТЬNULL(ЦеныОбщие.Цена, 0)) КАК ЦенаОбщая
	               |	ИЗ
	               |		ВТ_НоменклатураНабора КАК ВТ_НоменклатураНабора
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеЦеныКопмлектующих КАК ЦеныВНаборе
	               |			ПО ВТ_НоменклатураНабора.Комплектующая = ЦеныВНаборе.Номенклатура
	               |				И (ЦеныВНаборе.омг_Набор = &Набор)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеЦеныКопмлектующих КАК ЦеныОбщие
	               |			ПО ВТ_НоменклатураНабора.Комплектующая = ЦеныОбщие.Номенклатура
	               |				И (ЦеныОбщие.омг_Набор = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_НоменклатураНабора.Комплектующая) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура";
	Запрос.УстановитьПараметр("Набор", НаборНабор);
	Запрос.УстановитьПараметр("Филиалы", Филиалы);
	Запрос.УстановитьПараметр("ОсновнойПрейскурант", ОсновнойПрейскурантНабор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
		
КонецФункции


&НаКлиенте
Процедура НоменклатураНабораЦенаПриИзменении(Элемент)
	//
	//Если ЗначениеЗаполнено(Элементы.НоменклатураНабора.ТекущиеДанные.ВложенныйНабор) Тогда		
	//	
	//	стрПоиска = Новый Структура;
	//	стрПоиска.Вставить("Номенклатура",Элементы.НоменклатураНабора.ТекущиеДанные.ВложенныйНабор);
	//	
	//	СамНабор = НоменклатураНабора.НайтиСтроки(стрПоиска);
	//	Если СамНабор.количество() > 0 Тогда 
	//		СамНабор[0].ЦенаВНаборе = 0;
	//		стрПоиска = Новый Структура;
	//		стрПоиска.Вставить("ВложенныйНабор",Элементы.НоменклатураНабора.ТекущиеДанные.ВложенныйНабор);
	//		
	//		СтрокиНабора = НоменклатураНабора.НайтиСтроки(стрПоиска);
	//		
	//		Для каждого СтрокаНабора из СтрокиНабора Цикл
	//			СамНабор[0].ЦенаВНаборе = СамНабор[0].ЦенаВНаборе + СтрокаНабора.ЦенаВНаборе 
	//		КонецЦикла
	//		
	//	КонецЕсли;
	//  КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура НоменклатураНабораПриАктивизацииСтроки(Элемент)
	
	НоменклатураНабораВложенныйНабор.Очистить();
	       
	Если Элементы.НоменклатураНабора.ТекущиеДанные <> Неопределено и ЭтоНабор(Элементы.НоменклатураНабора.ТекущиеДанные.Номенклатура) Тогда		
		
		стрПоиска = Новый Структура;
		стрПоиска.Вставить("ВложенныйНабор",Элементы.НоменклатураНабора.ТекущиеДанные.Номенклатура);
		
		СамНабор = НоменклатураНабораВложенныйНаборВнутренний.НайтиСтроки(стрПоиска);
			Для каждого СтрокаНабора из СамНабор Цикл
				ЗаполнитьЗначенияСвойств(НоменклатураНабораВложенныйНабор.Добавить(),СтрокаНабора) 
			КонецЦикла
			
	КонецЕсли;

КонецПроцедуры      

Функция ЭтоНабор(Номенклатура) 
	
	ВозрЗначение = Ложь;
	Если Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда		
	ВозрЗначение = Истина;
	КонецЕсли;
    Возврат  ВозрЗначение;
	
	
КонецФункции	


&НаКлиенте
Процедура НоменклатураНабораВложенныйНаборЦенаОбщаяПриИзменении(Элемент)
	//
	//Если ЗначениеЗаполнено(Элементы.НоменклатураНабораВложенныйНабор.ТекущиеДанные.ВложенныйНабор) Тогда		
	//	
	//	стрПоиска = Новый Структура;
	//	стрПоиска.Вставить("Номенклатура",Элементы.НоменклатураНабораВложенныйНабор.ТекущиеДанные.ВложенныйНабор);
	//	
	//	СамНабор = НоменклатураНабора.НайтиСтроки(стрПоиска);
	//	Если СамНабор.количество() > 0 Тогда 
	//		СамНабор[0].ЦенаОбщая = 0;
	//		стрПоиска = Новый Структура;
	//		стрПоиска.Вставить("ВложенныйНабор",Элементы.НоменклатураНабораВложенныйНабор.ТекущиеДанные.ВложенныйНабор);
	//		
	//		СтрокиНабора = НоменклатураНабораВложенныйНабор.НайтиСтроки(стрПоиска);
	//		
	//		Для каждого СтрокаНабора из СтрокиНабора Цикл
	//			СамНабор[0].ЦенаОбщая = СамНабор[0].ЦенаОбщая + СтрокаНабора.ЦенаОбщая 
	//		КонецЦикла
	//		
	//	КонецЕсли;
	//КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ЗафиксироватьИзмененияВложенногоНабора(СтрокаТаблицыВложенногоНабора)
	
	Если ЗначениеЗаполнено(СтрокаТаблицыВложенногоНабора.ВложенныйНабор) Тогда		
		стрПоиска = Новый Структура;
		стрПоиска.Вставить("ВложенныйНабор",СтрокаТаблицыВложенногоНабора.ВложенныйНабор);
		стрПоиска.Вставить("Номенклатура",СтрокаТаблицыВложенногоНабора.Номенклатура);
		
		СтрокиИзменения = НоменклатураНабораВложенныйНаборВнутренний.НайтиСтроки(стрПоиска);
		
		Для каждого строкаИзменения из СтрокиИзменения Цикл
			ЗаполнитьЗначенияСвойств(строкаИзменения,СтрокаТаблицыВложенногоНабора);		
		КонецЦикла;	
		
		стрПоиска = Новый Структура;
		стрПоиска.Вставить("Номенклатура",СтрокаТаблицыВложенногоНабора.ВложенныйНабор);
		
		СамНабор = НоменклатураНабора.НайтиСтроки(стрПоиска);
		Если СамНабор.количество() > 0 Тогда 
			СамНабор[0].ЦенаВНаборе = 0;
			стрПоиска = Новый Структура;
			стрПоиска.Вставить("ВложенныйНабор",СтрокаТаблицыВложенногоНабора.ВложенныйНабор);
			
			СтрокиНабора = НоменклатураНабораВложенныйНабор.НайтиСтроки(стрПоиска);
			
			Для каждого СтрокаНабора из СтрокиНабора Цикл
				СамНабор[0].ЦенаВНаборе = СамНабор[0].ЦенаВНаборе + СтрокаНабора.ЦенаВНаборе;
				//ЗаполнитьЗначенияСвойств(НоменклатураНабораВложенныйНабор.Добавить(),СтрокаНабора)
			КонецЦикла
			
		КонецЕсли;
		
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНабораВложенныйНаборЦенаВНабореПриИзменении(Элемент)
	
	ЗафиксироватьИзмененияВложенногоНабора(Элементы.НоменклатураНабораВложенныйНабор.ТекущиеДанные);

КонецПроцедуры


&НаСервереБезКонтекста
Процедура УстановитьПериодДействияНаСервере(Набор, ПериодДействияНабора)
	
	НаборОбъект = Набор.ПолучитьОбъект();
	НаборОбъект.омг_ДатаНачалДействияНабора = ПериодДействияНабора.ДатаНачала;
	НаборОбъект.омг_ДатаОкончанияДействияНабора = ПериодДействияНабора.ДатаОкончания;
	НаборОбъект.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьПериодДействия(Команда)
	УстановитьПериодДействияНаСервере(Набор, ПериодДействияНабора);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСписокКомплектующих(Набор, Комплектующие)
	
	НаборОбъект = Набор.ПолучитьОбъект();
	НаборОбъект.КомплектующиеНоменклатуры.Очистить();
	Для Каждого СтруктураСтроки Из Комплектующие Цикл
		СтрокаКомплекта = НаборОбъект.КомплектующиеНоменклатуры.Добавить();
		СтрокаКомплекта.Комплектующая = СтруктураСтроки.Номенклатура;
		СтрокаКомплекта.Количество = СтруктураСтроки.Количество;
	КонецЦикла;
	НаборОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросООбновленииКомплектующих(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Комплектующие = Новый Массив;
	Для Каждого СтрокаТаблицы Из НоменклатураНабора Цикл
		СтруктураСтроки = Новый Структура("Номенклатура, Количество", СтрокаТаблицы.Номенклатура, СтрокаТаблицы.Количество);
		Комплектующие.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	ОбновитьСписокКомплектующих(Набор, Комплектующие);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКомплектующие(Команда)
	
	ТекстВопроса = "Выполнить обновление списка комплектующих набора? Позиции в карточке будут заменены на выбранные ниже.";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросООбновленииКомплектующих", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЦенуПозиции(Набор, Комплектующая, Филиалы, ОсновнойПрейскурант)
	
	Выборка = ПолучитьВыборкуЦен(Набор, Филиалы, ОсновнойПрейскурант, Комплектующая);
	
	Цены = Новый Структура("ЦенаВНаборе, ЦенаОбщая, Коэффициент");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Цены, Выборка);
	КонецЕсли;
	
	Возврат Цены;
	
КонецФункции

&НаКлиенте
Процедура НоменклатураНабораНоменклатураПриИзменении(Элемент)
	
	Цены = ПолучитьЦенуПозиции(Набор, Элементы.НоменклатураНабора.ТекущиеДанные.Номенклатура, Филиалы, ОсновнойПрейскурант);
	ЗаполнитьЗначенияСвойств(Элементы.НоменклатураНабора.ТекущиеДанные, Цены);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОПерезаполненииЦеныКомплектующихВложенногоНабора(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаНоменклатурыНабора = Элементы.НоменклатураНабора.ТекущиеДанные;
	
	Если СтрокаНоменклатурыНабора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщаяЦенаКоплектующих = НоменклатураНабораВложенныйНабор.Итог("ЦенаОбщая");
	Если ОбщаяЦенаКоплектующих = 0 Тогда
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из НоменклатураНабораВложенныйНабор Цикл
		КоэффициентРасчета = СтрокаТаблицы.ЦенаОбщая / ОбщаяЦенаКоплектующих;
		СтрокаТаблицы.ЦенаВНаборе = СтрокаНоменклатурыНабора.ЦенаВНаборе * КоэффициентРасчета;
		Если СтрокаТаблицы.ЦенаОбщая = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы.Коэффициент = СтрокаТаблицы.ЦенаВНаборе / СтрокаТаблицы.ЦенаОбщая;
		ЗафиксироватьИзмененияВложенногоНабора(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПропорционально(Команда)
	
	ТекстВопроса = "Перезаполить цены в наборе комплектующих вложенного набора?";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОПерезаполненииЦеныКомплектующихВложенногоНабора", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуВНаборе(СтрокаТаблицы)
	
	СтрокаТаблицы.ЦенаВНаборе = СтрокаТаблицы.ЦенаОбщая * СтрокаТаблицы.Коэффициент;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНабораКоэффициентПриИзменении(Элемент)
	ПересчитатьЦенуВНаборе(Элементы.НоменклатураНабора.ТекущиеДанные);
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураНабораЦенаОбщаяПриИзменении(Элемент)
	ПересчитатьЦенуВНаборе(Элементы.НоменклатураНабора.ТекущиеДанные);
КонецПроцедуры
